'''Task 6
Вовочка, сидячи на уроці, писав поспіль однакові слова (слово може складатися з однієї літери). Коли Марія Іванівна \
забрала у нього зошит, там був один рядок тексту. Напишіть програму, яка визначить найкоротше слово з написаних \
Вовочкою. Наприклад:
aaaaaaa - Вовочка писав слово - "a"
ititititit - Вовочка писав слово - "it"
catcatcatcat - Вовочка писав слово - "cat"'''



text = input('input text: ')
for i in range(len(text)):
    tmp = text[:i]
    if tmp == text:
        print('некорректный текст')
        break
    elif len(tmp)*text.count(tmp) == len(text):
        print(f'искомое слово - {tmp}')
        break
else:
    print('некорректный текст')